{"data":{"post":{"id":"99426130-a6e4-52d9-80c3-f886d3c8db1d","html":"<h2>عصر اعتماد</h2>\n<p>قبل از شروع، یادآوری یادآوری کنم که اگه اول\nاین مقاله\nرو بخونید، با اصطلاحات و مفاهیمی آشنا می‌شین که توی مقاله پیش رو باهاشون سر و کار داریم. پس اگه با واژه‌های «بول‌بول‌زی»، «بولی‌بولی» و «سموم» آشنا نیستین پیشنهاد می‌کنم اول یه سر به اون مقاله بزنین، هرچند شاید بدون دونستن دقیق منظور من از اون واژه‌ها هم معنای کلی این مقاله رو متوجه ‌بشید.\n\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/pokemunCard-51474e32a721e187257c11bb622b8d84-fc401.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 800px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 58.333333333333336%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAMABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAAMBBf/EABYBAQEBAAAAAAAAAAAAAAAAAAMCBP/aAAwDAQACEAMQAAABmruZuemSf//EABoQAQACAwEAAAAAAAAAAAAAAAEAAgMREiH/2gAIAQEAAQUCKzljpa+jMlnr/8QAFhEBAQEAAAAAAAAAAAAAAAAAABEB/9oACAEDAQE/AZqv/8QAFREBAQAAAAAAAAAAAAAAAAAAEBL/2gAIAQIBAT8Bo//EABcQAAMBAAAAAAAAAAAAAAAAAAABIDH/2gAIAQEABj8CHs//xAAaEAEAAwADAAAAAAAAAAAAAAABABEhMUGR/9oACAEBAAE/IQG7bdWojpR0hLjnyYbiQyMc/9oADAMBAAIAAwAAABDs3//EABgRAAIDAAAAAAAAAAAAAAAAAAABESFh/9oACAEDAQE/EIFTNH//xAAWEQEBAQAAAAAAAAAAAAAAAAABIQD/2gAIAQIBAT8QpuBbv//EABoQAQADAQEBAAAAAAAAAAAAAAEAEUEhMWH/2gAIAQEAAT8Q2ERUB+zBK8p2Bp6Gm6SlaNyhpK4RSXMn/9k='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px transparent;\"\n        alt=\"کارت های پوکمون\"\n        title=\"\"\n        src=\"/static/pokemunCard-51474e32a721e187257c11bb622b8d84-78f2b.jpg\"\n        srcset=\"/static/pokemunCard-51474e32a721e187257c11bb622b8d84-dce19.jpg 200w,\n/static/pokemunCard-51474e32a721e187257c11bb622b8d84-c1413.jpg 400w,\n/static/pokemunCard-51474e32a721e187257c11bb622b8d84-78f2b.jpg 800w,\n/static/pokemunCard-51474e32a721e187257c11bb622b8d84-ab4c4.jpg 1200w,\n/static/pokemunCard-51474e32a721e187257c11bb622b8d84-fc401.jpg 1296w\"\n        sizes=\"(max-width: 800px) 100vw, 800px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    \nمردم «بولی‌بولی» علاقه زیادی به کارت های پوکمون دارن که توسط بخش تفریح و سرگرمی «سموم» تولید می‌شه. هرچند این کارت ها چیزی جز تصاویر یه سری موجودات خیالی گوگولی نیستن، ما «بولی‌بولی‌ها» علاقه زیادی به جمع آوری اونها و تعویضشون باهمدیگه دارن تا بتونن کلکسیون هایی که می‌خوان رو بسازن</p>\n<p>تصور کنید که ما دو تا بچه مدرسه ای بولی‌بولیایی هستیم که در مدرسه روبروی هم نشستیم و داریم کارت های پوکمونمون رو باهم معامله می‌کنیم و تصمیم می‌گیریم دوتا کارت پوکمونمون که تقریباً هم ارزش هستن رو باهم عوض کنیم. هیچ دوز و کلکی در کار نیست. هردوی ما میخوایم این کار رو صادقانه انجام بدیم. پس من کارتم رو به شما میدم و شما هم کارتتون رو به من.</p>\n<p>به عنوان بچه‌های ده ساله، بدون اینکه نیازی به نظارت معلم داشته باشیم می‌تونیم این مبادله رو انجام بدیم.این کار خیلی راحته، چون این کارت ها فیزیکی هستن وصاحبانشون کاملاً مشخص. کارت مال کیه؟ کسی که اونو تو جیبش داره. به همین سادگی!</p>\n<p>اما راستش این این روش فقط درباره «اشیای فیزیکی» ساده و کارآمد به نظر میاد. چی میشه اگه ما بخوایم کارت های دیجیتالی پوکمونمون رو - که زیرمجموعه IT بخش تفریح و سرگرمی سموم تولید کرده- باهم عوض کنیم؟\nفرض کنیم من یک کارت دیجیتالی بسیار ارزشمند پوکمون دارم که فقط یک نسخه از اون وجود داره. و شما می‌خواین اون رو از من بخرین؟ شما چطور می‌تونین مطمئن بشین که من قبل از ارسال اون برای شما یک کپی از اون برای خودم برنداشتم؟ اگه من ۱۰۰۰ تا از اون کارت کپی کرده باشم و اونها رو به هزار نفر فروخته باشم،‌دیگه اون کارت ها ارزشی که شما فکر میکنین رو نداره. درسته؟\nمتأسفانه باید بگم هیچ راهی وجود نداره که شما از این موضوع مطمئن بشین.\nجای عکس\nاین مشکل یک اسم دارد : «double-spending». با یک آشنایی ساده به زبان بولی‌بولیایی میشه فهمید معنای این عبارت چیزی شبیه «خرج کردن دوباره» میشه.اما من تو این مقاله ترجیح میدم از همون عبارت double-spending استفاده کنم تا با اصطلاحات حوزه <strong>بلاکچین</strong> بیشتر آشنا بشین.\nبرای حل این مشکل می‌تونیم از یک ledger استفاده کنیم – معنای فارسیش میشه «دفتر کل»- «لجر» رو یک دفتر کل درنظر بگیرین که لیست همه اموال و دارایی‌ها رو توش می‌نویسیم.\nتو مثال بالا این دفتر کل رو -مرکز «سموم» نگه میداره. اونه که تعیین میکنه هرکدوم از کارت ها مال کیه و طبیعتاً «سموم» هست که می‌تونه مالکیت این کارت ها رو عوض کنه. اینجوری دیگه مشکل «double-spending» پیش نمیاد.\nاما خب این رویکرد یک مشکلی داره و این هم اینه که مجبور شدیم شخص ثالثی(third party) رو به عنوان «واسطه»وارد ماجرا کنیم.</p>\n<p>حالا وضعیت با وضعیت مدرسه ای ما فرق کرد. حالا ما باید به یک نفر سوم اعتماد کنیم و مطمئن باشیم که اون دفتر کل رو دستکاری نمی‌کنه. اما اگر «سموم» تصمیم بگیره دفتر کل رو به نفع خودش تغییر بده چه کاری از ما برمیاد؟ خصوصا که از وقتی ارتش کنترل «سموم» رو به دست گرفته غیرقابل اطمینان تر هم شدن.\nما هیچ وقت نمیتونیم ۱۰۰ درصد مطمئن باشیم که اونا همچین کاری نمیکنن. پس بیاید به قضیه جور دیگه ای نگاه کنیم. چی میشه اگه به جای اینکه ما لجرمون رو توی مرکز «سموم» نگه داریم، یک کپی ازش رو به هرکدوم از معامله گران پوکمون بدیم؟\nهزاران هزار پوکمون باز در سراسر «بول‌بول‌زی» وجود داره. می‌تونیم بگیم هرکسی یک کپی از لجر – یا همون دفتر کل- رو نگه داره و هروقت که مبادله ای انجام شد ما به همه خبربدیم تا تغییر مالکیت کارت‌ها رو توی دفتر کلشون وارد کنن.\nبرگردیم به مبادله خودمون. لجرها ثبت کردن که من تنها یه دونه از این کارت دارم و بعد از معامله،‌ همه دارایی من رو به شما منتقل می‌کنن. اینجوری من دیگه نمیتونم کارتم رو دوبار بفروشم.\nممکنه فکر کنین که خبر دادن این معامله به همه پوکمون بازهای «بول‌بول‌زی» کار پیچیده ایه ، اما اینطور در نظر بگیرین که ما ۱۰۰۰ کامپیوتر در سراسر «بول‌بول‌زی» داریم که سیستم معاملات کارت های پوکمون ما رو نگهداری می کنن. بیاین اسم این کامپیوترها رو نود (node) بزاریم.\nهمه نود ها یک کپی از لجر رو دارن و همه اون ها می‌تونن از طریق اینترنت باهمدیگه در ارتباط باشن. هدف همشون هم اینه که به صورت مستقل هر معامله کارت پوکمونی رو ثبت کنن.\nاین نودها باید درباره تراکنش ها باهمدیگه توافق داشته باشن. تراکنش ها می‌تونن جابجایی کارت ها یا به وجود اومدن کارت جدید باشن.\nسیستم کار به این شکل می‌شه که اگه من یک معامله ای با شما بکنم این تراکنش به یک «استخر موقت تراکنش های تأیید نشده» میره. هر چند وقت یک بار (مثلاً هر ده دقیقه) همه این تراکنش ها به‌ گروه خاصی از نودها ارسال می‌شن و اون نودهای خاص هم اون ها رو تأیید می‌کنن و نتیجه رو برای همه لجرها میفرستن.\nبه این نودهای خاص ماینر (به معنی معدنچی) میگیم. کار معدنچی ها اینه که تمام تراکنش هایی که توی ده دقیقه انجام میشه رو توی یک برگه (بلوک) یادداشت کنن و به همه بگن که این بلوک رو به انتهای دفترکل اضافه کنیم. اینجوری همه ما تاریخ همه معاملات کارت های پوکمون رو در یک زنجیره ای از بلوک ها – که بهش <strong>بلاکچین</strong>- می‌گیم نگهداری می‌کنیم.\nخب حالا اگه ماینرهای ما انگیزه‌ای برای دسته بندی و ارسال این تراکنش ها نداشته باشن چی میشه؟ اون وقت کل سیستم ما می‌خوابه و تراکنش ها تأیید و ثبت نشده باقی می‌مونه. برای اینکه این مشکل پیش نیاد ما به ماینرها یک انگیزه جذاب میدیم. بهشون میگیم که به ازای هر بلوکی که تأیید کنن چند تا کارت پوکمون جایزه می‌گیرن. احتمالاً اگه این کار رو بکنیم نه تنها بلوک‌هامون تأیید نشده رها نمی‌شن بلکه برای تأیید اونها بین ماینرها رقابت هم شکل میگیره.\nاما حالا مشکل دیگه ای داریم. اگه جایزه ما اینقدر جذاب باشه که همه بخوان بلوک ها رو تأیید کنن چیکار کنیم؟ ما تنها به یک ماینر احتیاج داریم که این بلوک جدید رو بسازه و آدرسش رو برای همه ارسال کنه تا همه بتونن به انتهای زنجیره بلوکشون اضافه کنن. اگه همه بخوان این وسط بلوک‌‌سازی کنن، اونوقت به جای یک بلوک چندین بلوک – در آدرس‌های مختلف- ساخته می‌شه که محتواشون عین همدیگست و ما نمیدونیم کدومشون رو به زنجیرمون اضافه کنیم و پاداش رو به ماینرش بدیم!\nخب همه چی چاره داره. برای حل این مشکل هم می‌تونیم یک محاسبات خیلی بزرگ پیچیده به کامپیوتر ماینرها بدیم که برای حلش احتیاج به اعداد تصادفی و محاسبات ریاضی داشته باشن. به این صورت که یک عدد تصادفی رو توی فرمول می‌زاره. اگه خروجی به دست اومده همون چیزی شد که انتظار داشتیم – که احتمالش کمه- ماینر به همه اعلام می‌کنه من جواب رو پیدا کردم و اون عدد رو برای همه میفرسته. اگه بقیه هم وقتی عدد رو توی فرمول گذاشتن نتیجه درست در اومد میفهن که ماینرمون دروغ نگفته و واقعاً تلاش کرده و معدله رو حل کرده. در نتیجه جایزشو می‌دیم، بلوکشو به انتهای زنجیر اضافه می‌کنیم و به بقیه میگیم ۱۰ دقیقه صبر کنن تا بلوک بعدی آماده بشه. شاید اونجا شانس باهاشون بیشتر یار باشه!\nاگه خوب دقت کرده باشین می‌بینین که تو این سیستم هیچ نودی به نود دیگه چشم بسته اعتماد نمی‌کنه. بلکه حتماً خودش عدد اعلام شده «ماینر خوش شانس» رو امتحان می‌کنه و مطمئن میشه دوز و کلکی تو کارش نیست. این روشیه که کل شبکه به اجماع (consensus) می‌رسه.\nحالا یه مشکل دیگه. فرض کنین یک نفر آدم متقلب می‌خواد مرتکب double-Spending یا همون «دوبار خرج کردن» بشه و کارتش رو همزمان به شما و یک نفر دیگه واگذار کنه.\nاینجا آدم متقلب دو تا تراکنش رو به «استخر موقت تراکنش های تأیید نشده» می‌فرسته تا تاییدشون کنه. شبکه اجازه نمیده هر دو تراکنشش ثبت بشه و تنها یکیش رو تأیید میکنه و نقشه فرد متقلب نقش بر آب می‌شه اما یک اتفاق بد هم ممکنه برای شما بیفته! اون چیه؟ اینکه تراکنشی که کارتش رو به فرد دیگری غیر از شما فروخته قبل از شما صادر شده باشه و درنتیجه تراکنشی که شما رو صاحب کارت می‌کنه باطل بشه. اینجا اگه شما روی اون تراکنش حساب کرده باشین دستتون تو پوست گردو می‌مونه – مثلاً فرض کنین در ازای این کارت پوکمون بهش یک پولی دادین و اون هم پولش رو گرفته و رفته!\nچطور می‌تونین از این مشکل جلوگیری کنین؟ راهش اینه که بعد از انجام تراکنش حداقل ۱۰ دقیقه صبر کنین تا اون توی <strong>بلاکچین</strong> ثبت بشه. بعد از اینکه مطمئن شدین تراکنش شما توی <strong>بلاکچین</strong> ثبت شده،‌ حالا میتونین پول رو بهش پرداخت کنین.\nحالا وقتشه آخرین راز <strong>بلاکچین</strong> رو هم بهتون بگم. همونجور که احتمالاً فهمیدید بلوک های حاوی تراکنش های ما توی <strong>بلاکچین</strong> به صورت خطی و بر اساس زمان پشت همدیگه ثبت میشن. - اصلاً به همین دلیله که به این شبکه زنجیره بلوک یا <strong>بلاکچین</strong> میگیم- چی میشه اگه بخوایم مثلاً بلوکی که ۹۰ دقیقه پیش ثبت شده رو تغییر بدیم و اطلاعاتش رو عوض کنیم؟\nاین مسأله جواب ساده داره و جواب طولانی. برای اینکه جواب طولانیش رو بدم باید براتون از کریپتوگرافی و هش و چیزهای دیگه ای بگم که فعلاً ضرورتی نداره اما جواب کوتاهش اینه که نمیشه.\nهر بلوکی که توی <strong>بلاکچین</strong> ثبت می‌کنیم یک آدرسی داره که این آدرس توی بلوک بعدی دخیره شده. حالا اگه بخوایم اطلاعات یه بلوک رو عوض کنیم آدرس اون هم تغییر می‌کنه – چراش برمیگرده به همون جواب طولانی- و اونوقت بلوک بعدیش دیگه نمیتونه پیداش کنه. پس مجبور می‌شیم محتوای بلوک بعدی رو هم تغییر بدیم و آدرس جدید رو توش بنویسیم. اما خب با این کار حالا آدرس این‌یکی بلوک عوض میشه و بلوک بعدیش دیگه نمیتونه پیداش کنه.\nدرکل اینجور براتون بگم که اگه بخوایم محتوای یک بلوک تو <strong>بلاکچین</strong> رو عوض کنیم، تمام بلوک های بعدی به هم می‌ریزن و باطل می‌شن.\nنتیجه‌ای که می‌گیریم اینه که داده‌ای که توی <strong>بلاکچین</strong> ذخیره می‌شه غیرقابل تغییره و نمیشه عوضش کرد.</p>\n<p>خب،‌ به همین سادگی – و البته با کلی پیچیدگی فنی- ما یک سیستم شفاف،‌امن ،غیرمتمرکز و غیرقابل تغییر برای معاملات کارت هامون ساختیم.\nاین سیستم شفافه چون تمام تراکنش ها توی لجر همه نودها ثبت می‌شه و درنتیجه همه می‌تونن اون رو ببینن. امنه چون برخلاف سیستم‌های متمرکز که همه داده هامون توی یک سرور ذخیره شده و اگه کسی بتونه اون رو هک کنه، کل داده‌ها فنا رفته، اینجا داده‌ها رو توی هزاران نود ذخیره می‌کنیم و هک همزمان هزاران نود خیلی خیلی سخت تره. غیرمتمرکز بودنش که واضحه و درباره غیرقابل تغییر بودنش هم براتون توضیح دادم.\nهرچند این مثال بسیار ساده بود اما امیدوارم تونسته باشه بک درک کلی به شما بده که تکنولوژی <strong>بلاکچین</strong> چطور کار می‌کنه . تکنولوژی ای که سازنده‌ رمزارزهای متنوعی مثل بیت کوینه و می‌تونه بدون دخالت و نظارت واسطه ها و آقابالاسرها دارایی‌های مارو مدیریت کنه!</p>","fields":{"slug":"/بلاکچین چطور کار می‌کنه/","prefix":"1397-09-30"},"frontmatter":{"title":"بلاکچین چطوری کار می‌کنه","author":"نوید گل پور","category":"بلاکچین","cover":{"childImageSharp":{"resize":{"src":"/static/pokemunCard-51474e32a721e187257c11bb622b8d84-ada8c.jpg"}}}}},"authornote":{"id":"9a8eef3a-10fc-5fec-8da7-6f7776820e12","html":"<p>نوید گل پور، هم‌بنیان‌گذار استارتاپ\n<a href=\"https://www.bloock.ir/\">بلووک</a>\nهستم که یک پلتفرم اجاره کتاب بر بستر بلاکچینه. و دوست دارم درباره تکنولوژی های رنگارنگ جدید و تاثیرات سیاه و سفیدشون تو زندگی آدم های خاکستری مطلب‌ بنویسم.</p>"},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"slug":"/بلاکچین چطور کار می‌کنه/","prev":{"id":"1a5e95f4-64a0-5789-a610-bc84ea0cd7a6","fields":{"slug":"/سهم» مارو دزدیدین، دارین باهاش پز می‌دین/","prefix":"1397-09-19","source":"posts"},"frontmatter":{"title":"«سهم» مارو دزدیدین، دارین باهاش پز می‌دین","category":"دنیای غیرمتمرکز"}},"source":"posts"}}